Revit 2027 API
TableSectionData.GetCellCombinedParameters(Int32) Method
 Returns an array of combined parameter data for the specified column
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TableCellCombinedParameterData> GetCellCombinedParameters(
	int nCol
)
Public Function GetCellCombinedParameters (
	nCol As Integer
) As IList(Of TableCellCombinedParameterData)
public:
IList<TableCellCombinedParameterData^>^ GetCellCombinedParameters(
	int nCol
)
member GetCellCombinedParameters :
        nCol : int -> IList<TableCellCombinedParameterData>
Parameters
nCol Int32
Return Value
IList<TableCellCombinedParameterData>
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellCombinedParameters Overload
Autodesk.Revit.DB Namespace